martuan/ESP32-INTI-Electronica/firmware/src/main.cpp
char estadoPin = 0;
bool flagCheckArgs = 0;
String ultimoDirExplorado = {};

int pinLED = 15;

int cuentaIntentos = 0;

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void setup(void){
  
  	Serial.begin(115200);

	//initSPIFFS();
	pinMode(16, OUTPUT);
	pinMode(pinLED, OUTPUT);
	
	//File root;
  	int cuenta = 0;

      // Nos conectamos a nuestra red Wifi
	Serial.println();
	Serial.print("Conectando a ssid: ");
	Serial.println(ssid_1);

	
	WiFi.begin(ssid_1, password_1);

	while ((WiFi.status() != WL_CONNECTED) && cuenta < 20) {//límite de 20 intentos de 500 ms
		delay(500);
		Serial.print(".");
		cuenta++;
	
	}
	if(WiFi.status() != WL_CONNECTED){//si no logró conectarse
	
		Serial.println("No es posible conectar a WiFi");
		Serial.println("Se cambia a MODO LOCAL");


	}else{//si logró conectarse

		Serial.println("");
		Serial.println("Conectado a red WiFi!");
		Serial.println("Dirección IP: ");
		Serial.println(WiFi.localIP());
		
	}

	Serial.println("\nConnected to "+WiFi.SSID()+" Use IP address: "+WiFi.localIP().toString()); // Report which SSID and IP is in use
	// The logical name http://fileserver.local will also access the device if you have 'Bonjour' running or your system supports multicast dns
	if (!MDNS.begin(servername)) {          // Set your preferred server name, if you use "myserver" the address would be http://myserver.local/
		Serial.println(F("Error setting up MDNS responder!")); 
		ESP.restart(); 
	} 
	#ifdef ESP32
	// Note: SD_Card readers on the ESP32 will NOT work unless there is a pull-up on MISO, either do this or wire one on (1K to 4K7)
		//Serial.println(MISO);
		pinMode(19,INPUT_PULLUP);
	#endif

	SPI.begin(SCK, MISO, MOSI, SD_CS_pin);

	Serial.print(F("Initializing SD card...")); 

	SD.begin(SD_CS_pin);//prueba
	
	if (!sd.begin(SD_CS_pin, SD_SCK_MHZ(20))) { // see if the card is present and can be initialised. Wemos SD-Card CS uses D8 
		Serial.println(F("Card failed or not present, no SD Card data logging possible..."));
		SD_present = false; 
	} 
	else
	{
		Serial.println(F("Card initialised... file access enabled..."));
		SD_present = true; 
	}

	// Note: Using the ESP32 and SD_Card readers requires a 1K to 4K7 pull-up to 3v3 on the MISO line, otherwise they do-not function.
	//----------------------------------------------------------------------   
	///////////////////////////// Server Commands 


// Send web page with input fields to client

	server.on("/", HTTP_GET, [](AsyncWebServerRequest *request){
	  cuentaIntentos++;
	if (logueado == 0) { //ofrece loguin
		request->send_P(200, "text/html", index_html);
	}else{ //hay otro usuario logueado
		String htmlToSend = "Servidor web ocupado...Intento Nº"+String(cuentaIntentos)+"<br><a href=\"/\">Retornar a pantalla inicio</a>";
		//String htmlToSend = "Servidor web ocupado...Intento Nº<br><a href=\"/\">Retornar a pantalla inicio</a>";
		//request->send_P(200, "text/html","Servidor web ocupado...Intento Nº"+String(cuentaIntentos)+"<br><a href=\"/\">Retornar a pantalla inicio</a>");
		request->send_P(200, "text/html", htmlToSend.c_str());
	}
  });

  server.on("/login", HTTP_POST, [] (AsyncWebServerRequest *request) {
    String inputUsuario;
    String inputPass;

	Serial.println("cantidad de parametros = ");
	Serial.println(request->params());

    inputUsuario = request->getParam(0)->value();
    inputPass = request->getParam(1)->value();

    Serial.print("Usuario: ");    
    Serial.println(inputUsuario);
    Serial.print("Clave: ");    
    Serial.println(inputPass);
    
    if(inputUsuario == userEnabled1 && inputPass == passEnabled1){
      
      logueado = 1;
      Serial.println(logueado);

	  request->redirect("/menu");

    }else{
      Serial.println(logueado);

      request->send(200, "text/html", "<p>HTTP POST enviado - credenciales no validas</p>" 
                                        "<br><a href=\"/\">Retornar a pantalla inicio</a>");
    }

  });
  
  server.on("/menu", HTTP_ANY, [] (AsyncWebServerRequest *request) {
    
    Serial.print("Entrando al menu MENU....");    
    Serial.println(logueado);

    request->send(200, "text/html", menu_html);
  });
  
  server.on("/dir", HTTP_POST, [] (AsyncWebServerRequest *request) {
    
    Serial.print("Entrando al menu DIR....");    
    Serial.println(logueado);
    cuentaDIR += 1;
    Serial.println(cuentaDIR);

	String param1;
    String param2;

	//request->send(200, "text/html", menu_html);
	//request->hasArg()

	listar_SD_dir(param1, param2, request);

//**************** contenido de listar_SD_dir ******************
//**************************************************************


	Serial.println("cantidad de parametros = ");
	Serial.println(request->params());
	param1 = request->getParam(0)->value();
    //param2 = request->getParam(0)->value();
	Serial.println(param1);

	cuentaIntentos++;
  });

  server.on("/logout", HTTP_ANY, [] (AsyncWebServerRequest *request) {
    String inputUsuario;
    String inputPass;

    logueado = 0;
    cuentaDIR = 0;
    Serial.println(logueado);
    
    request->redirect("/");

  });

  server.on("/muestraIP", HTTP_ANY, [] (AsyncWebServerRequest *request) {

    Serial.print("Solicitud HTTP desde IP: ");    
    //Serial.println(inputIP);
    Serial.println(request->client()->remoteIP());
    Serial.println(logueado);
    //logueado = 0;
    request->send(200, "text/html", "Solicitud HTTP desde IP: "
                        + (request->client()->remoteIP()).toString() +
                        "<br><a href=\"/\">Retornar a Menu Principal</a>"
                        "<br><a href=\"/logout\">Desconectarse de la Web</a>");

  });


 
  server.on("/download", HTTP_ANY, [] (AsyncWebServerRequest *request) {

    Serial.print("Solicitud HTTP desde IP: ");    
    //Serial.println(inputIP);
    Serial.println(request->client()->remoteIP());
    Serial.println(logueado);



	if (request->hasArg("download")){
		Serial.print("argumento = ");
		Serial.println(request->getParam(0)->value());
		SD_file_download(request->getParam(0)->value(), request);

