martuan/ESP32-INTI-Electronica/firmware/src/main.cpp
	} 
	//request->send(SPIFFS, "/file.html", "text/html", true);

/*
    //logueado = 0;
    request->send(200, "text/html", "Solicitud HTTP desde IP: "
                        + (request->client()->remoteIP()).toString() +
                        "<br><a href=\"/\">Retornar a Menu Principal</a>"
                       "<br><a href=\"/logout\">Desconectarse de la Web</a>");
*/
  });
  
 
  server.onNotFound(notFound);
  server.begin();

  ///////////////////////////// End of Request commands

  	Serial.println("HTTP server started");


	// //******************** NESTOR ********************

	// pinMode(LED_BUILTIN, OUTPUT);
	// pinMode(pulsadorInicio, INPUT);
	// pinMode(activarElectrovalvula, OUTPUT);
	// pinMode(pulsadorCalibracion, INPUT);

	// boolean calibracion;
	// boolean memoriaSDinicializada = false;
	// //********************************************

	// // initializar the LCD
	// lcd.begin(20,4);
	// // Turn on the blacklight and print a message.
	// lcd.backlight();
	// lcd.print("INTI CAUCHOS");
	// memoriaSDinicializada = tarjetaSD1.inicializarSD();
	// //  if (!SD.begin(CS)) {
	// if(!memoriaSDinicializada){
	// 	Serial.println("inicialización fallida!"); 
	// 	lcd.setCursor(0, 0);
	// 	lcd.print("SD NO encontrada");
	// //while(!SD.begin(CS)){
	// while(!memoriaSDinicializada){
	// 	digitalWrite(LED_BUILTIN, HIGH);   // turn the LED on (HIGH is the voltage level)
	// 	lcd.backlight();
	// 	delay(500);                       // wait for a half second
	// 	digitalWrite(LED_BUILTIN, LOW);    // turn the LED off by making the voltage LOW
	// 	lcd.noBacklight();
	// 	delay(500);                       // wait for a half second
	// 	memoriaSDinicializada = tarjetaSD1.inicializarSD();
	// }
	
	// lcd.backlight();
	// lcd.clear();

	// } 
	// // **********************************************************************
	// if (! rtc.begin()) {
	// 	//   Serial.println("Couldn't find RTC");
	// 	while (1);
	// }

	// if (rtc.lostPower()) {
	// 	//    Serial.println("RTC lost power, lets set the time!");
	// }
	// //**********************************************************************
	// dht.begin();    //Inicializar sensor de temperatura
	// EEPROM.begin(EEPROM_SIZE);
	
	// imprimirLCDfijo("Pulse INICIO",0, 0);
	// imprimirLCDfijo("para comenzar",0, 1);



}
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void loop(void){



	if (WiFi.status() != WL_CONNECTED) {
      Serial.println("WiFi desconectado..");
	  reconnectWifi();
    }

	
	/*
	boolean estadoPulsadorInicio;

	estadoPulsadorInicio = digitalRead(21);

	if(estadoPulsadorInicio == LOW && flagWebserverLibre){//chequea que no se esté accediendo a la memoria SD desde el webserver
	
		flagWebserverLibre = 0;//se ocupa el webserver
		Serial.println("NO se puede acceder a la memoria SD desde el webserver");
		toggleLED10veces();
		flagWebserverLibre = 1;//se libera el webserver
		Serial.println("SI se puede acceder a la memoria SD desde el webserver");
	
	}
*/

}

// All supporting functions from here...
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
/*
void File_Download(){ // This gets called twice, the first pass selects the input, the second pass then processes the command line arguments

//	flagWebserverLibre = 0;//se ocupa el webserver

	if (server.args() > 0 ) { // Arguments were received
		if (server.hasArg("download")){
			SD_file_download(server.arg(0));
			Serial.print("argumento = ");
			Serial.println(server.arg(0));
		} 
	}
	else SelectInput("Enter filename to download","download","download");

//  	flagWebserverLibre = 1;//se libera el webserver

}
*/
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void SD_file_download(String filename, AsyncWebServerRequest *request){

  if (SD_present) { 

	File download2 = SD.open("/"+filename);
	
	SdFile download;

	download.open(filename.c_str());

	if (download) {
		Serial.print("Existe el archivo = ");
		Serial.print(filename);
		Serial.print(" ");

		//Serial.println(String(download.name()));
		Serial.println("Se descarga el archivo");
		Serial.println();
		
		request->send(download2, filename.c_str(), "text/html", true);
		/*
		server.sendHeader("Content-Type", "text/text");
		server.sendHeader("Content-Disposition", "attachment; filename="+filename);
		server.sendHeader("Connection", "close");
		server.streamFile(download2, "application/octet-stream");
		*/
		download.close();
		download2.close();
    }else ReportFileNotPresent("download"); 
  }else ReportSDNotPresent();

}


void listar_SD_dir(String param1, String param2, AsyncWebServerRequest *request){


	Serial.println("cantidad de parametros = ");
	Serial.println(request->params());
	param1 = request->getParam(0)->value();

	Serial.println(param1);


	if(logueado){
		Serial.println("usuario logueado");
		 if (SD_present) {
			 

    
			if(param1 == ROOTDIR){

				root.open(ROOTDIR);

			}else{
				
				String directorio = param1;
				

				if (request->hasArg("directorio")){//si se pide avanzar adelante (un directorio nuevo)
					
					pathDirectory = pathDirectory + directorio + "/" ;
					Serial.print("pathDirectory = ");
					Serial.println(pathDirectory);
					
				}else if(request->hasArg("directorioAtras")){//si se pide avanzar atrás (el directorio padre)

					if(pathDirectory != ROOTDIR){
						
						
						pathDirectory = pathDirectory.substring(0, pathDirectory.lastIndexOf('/'));//recorta
						pathDirectory = pathDirectory.substring(0, pathDirectory.lastIndexOf('/')+1);//recorta
						Serial.print("pathDirectory (atras) = ");
						Serial.println(pathDirectory);

					}
					

				}

				root.open(pathDirectory.c_str());

			}


			if (root) {
				root.rewindDirectory();

				webpage += F("<h3 class='rcorners_m'>Contenido de la memoria SD</h3><br>");
				webpage += F("<form action='/consultarPorFecha'><label for='Fecha'>Fecha: </label><input type='date' id='fechaEnsayo' name='fechaEnsayo'><input type='submit'></form><br>");

				webpage += "<h3 align = 'left'>Directorio actual = "+ pathDirectory + "</h3>";

				webpage += F("<table class='table table-striped'>");
				webpage += F("<tr><th scope='col'>Nombre</th><th scope='col'>Fecha</th><th scope='col'>Archivo/Directorio</th><th scope='col'>Tama&ntildeo</th><th scope='col'>Eliminar</th><th scope='col'>Descargar</th></tr>");
				webpage += "<tr><td><form action='/dir' method='post'><input type='hidden' name='directorioAtras' id='directorioAtras' value='../'><input type='Submit' value='../'></form></td><td></td><td></td><td></td><td align='center'></td><td></td></tr>";

				printDirectory_v5(root);

				webpage += F("</table>");
				fechaEnsayoConsultada = "";
				
				String prueba = webpage;
				
				armarPaqueteHtml(prueba);

