martuan/ESP32-INTI-Electronica/firmware/src/main.cpp
				request->send(200, "text/html", paquete_html.c_str());

				root.close();
			}
			else{
				webpage += F("<h3>No Files Found</h3>");
			}

		} else ReportSDNotPresent();

	}
}

void printDirectory_v5(SdFile path){

	char entryName[100] = {};
	String nombreDeArchivo = {};
	String rutaDeArchivo = {};
	bool hayMasArchivos = 0;
	String dirNuevo = {};
	Serial.println("----------------Entra al printDirectory_v5-----------------------");
	Serial.print("pathDirectory = ");
	Serial.println(pathDirectory);
	String fechaNormalizada = {};

	while(entry.openNext(&path, O_RDONLY)){

		/*
		if (webpage.length() > 1000) {
			SendHTML_Content();
		}
*/
		entry.getName(entryName, 100);//obtiene el nombre de la entrada, ya sea un directorio o un archivo
		
		if(entry.isDirectory()){//Si es un directorio
			
			rutaDeArchivo = String(entryName);
			
			webpage += "<tr><td><form action='/dir' method='post'><input type='hidden' name='directorio' id='directorio' value="+ String(rutaDeArchivo) +"><input type='hidden' name='cuenta' id='cuenta' value="+ String(cuenta) +"><input type='Submit' value="+String(rutaDeArchivo)+"></form></td><td></td><td>"+String(entry.isDirectory()?"Dir":"File")+"</td><td></td><td align='center'></td><td></td></tr>";


			
		}
		else//Si es un archivo
		{
			
			nombreDeArchivo = String(entryName);
			//rutaDeArchivo = rutaDeArchivo + "/" + nombreDeArchivo;
			rutaDeArchivo = pathDirectory + nombreDeArchivo;
			filename = nombreDeArchivo;
			Serial.println(filename);

			if(filename.endsWith(".csv")){
				Serial.println("termina con .csv");
			}

			
			if(filename.charAt(8) == 'T'){//si el archivo es una fecha de ensayo
				Serial.print("CharAt(8) = T		");
				fechaNormalizada = obtenerFechaDeArchivo();
				Serial.print("fechaNormalizada =");
				Serial.println(fechaNormalizada);

			}else{
				fechaNormalizada = "";
			}
					
			agregaFilaEnTabla(rutaDeArchivo, fechaNormalizada, rutaDeArchivo);
						
					
		}
		entry.close();
	}
}
/*
void File_Delete(){

	flagWebserverLibre = 0;//se ocupa el webserver

	if (server.args() > 0 ) { // Arguments were received
		if (server.hasArg("delete")) SD_file_delete(server.arg(0));
	}
	else SelectInput("Select a File to Delete","delete","delete");

	flagWebserverLibre = 1;//se libera el webserver
}
*/
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
/*
void SD_file_delete(String filename) { // Delete the file 
  if (SD_present) { 
    SendHTML_Header();
    File dataFile = SD.open("/"+filename, FILE_READ); // Now read data from SD Card 
    Serial.print("Deleting file: "); Serial.println(filename);
    if (dataFile)
    {
      if (SD.remove("/"+filename)) {
        Serial.println(F("File deleted successfully"));
        webpage += "<h3>File '"+filename+"' has been erased</h3>"; 
        webpage += F("<a href='/dir'>[Back]</a><br><br>");
      }
      else
      { 
        webpage += F("<h3>File was not deleted - error</h3>");
        webpage += F("<a href='/dir'>[Back]</a><br><br>");
      }
    } else ReportFileNotPresent("delete");
    append_page_footer(); 
    SendHTML_Content();
    SendHTML_Stop();
  } else ReportSDNotPresent();
} 
*/


//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

void SelectInput(String heading1, String command, String arg_calling_name){
  //SendHTML_Header();
  webpage += F("<h3>"); webpage += heading1 + "</h3>"; 
  webpage += F("<FORM action='/"); webpage += command + "' method='post'>"; // Must match the calling argument e.g. '/chart' calls '/chart' after selection but with arguments!
  webpage += F("<input type='text' name='"); webpage += arg_calling_name; webpage += F("' value=''><br>");
  webpage += F("<type='submit' name='"); webpage += arg_calling_name; webpage += F("' value=''><br><br>");
  //append_page_footer();
  //SendHTML_Content();
  //SendHTML_Stop();
}
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void ReportSDNotPresent(){
  //SendHTML_Header();
  webpage += F("<h3>No SD Card present</h3>"); 
  webpage += F("<a href='/'>[Back]</a><br><br>");
  //append_page_footer();
  //SendHTML_Content();
  //SendHTML_Stop();
}
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void ReportFileNotPresent(String target){
  //SendHTML_Header();
  webpage += F("<h3>File does not exist</h3>"); 
  webpage += F("<a href='/"); webpage += target + "'>[Back]</a><br><br>";
  //append_page_footer();
  //SendHTML_Content();
  //SendHTML_Stop();
}
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void ReportCouldNotCreateFile(String target){
  //SendHTML_Header();
  webpage += F("<h3>Could Not Create Uploaded File (write-protected?)</h3>"); 
  webpage += F("<a href='/"); webpage += target + "'>[Back]</a><br><br>";
  //append_page_footer();
  //SendHTML_Content();
  //SendHTML_Stop();
}
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
String file_size(int bytes){
  String fsize = "";
  if (bytes < 1024)                 fsize = String(bytes)+" B";
  else if(bytes < (1024*1024))      fsize = String(bytes/1024.0,3)+" KB";
  else if(bytes < (1024*1024*1024)) fsize = String(bytes/1024.0/1024.0,3)+" MB";
  else                              fsize = String(bytes/1024.0/1024.0/1024.0,3)+" GB";
  return fsize;
}


void listDir(fs::FS &fs, const char * dirname, uint8_t levels){
  Serial.printf("Listado de directorio: %s\n", dirname);

  File root = fs.open(dirname);
  if(!root){
    Serial.println("Failed to open directory");
    return;
  }
  if(!root.isDirectory()){
    Serial.println("Not a directory");
    return;
  }

  File file = root.openNextFile();
  while(file){
    if(file.isDirectory()){
      Serial.print("  DIR : ");
      Serial.println(file.name());
      if(levels){
        listDir(fs, file.name(), levels -1);
      }
    } else {
      Serial.print("  Archivo: ");
      Serial.print(file.name());
      Serial.print("  Tamaño: ");
      Serial.println(file.size());
    }
    file = root.openNextFile();
  }
}

