martuan/ESP32-INTI-Electronica/firmware/src/main.cpp
// Initialize SPIFFS
void initSPIFFS() {
	if (!SPIFFS.begin()) {
		Serial.println("An error has occurred while mounting SPIFFS");
	}
		Serial.println("SPIFFS mounted successfully");
}

void ConsultarPorFecha(void){
/*
	fechaEnsayoConsultada = "";//borra la anterior consulta
	pathDirectory = "";//resetea la ruta

	SendHTML_Header();
	
	webpage += F("<h3>Consultar Por Fecha (en desarrollo)</h3>");

	if (server.args() > 0 ) { // Arguments were received
    	if (server.hasArg("fechaEnsayo")){


			fechaEnsayoConsultada = server.arg(0);
			webpage += F("<p>No se encontraron archivos</p>");
			webpage += "<p>fechaEnsayo = " + fechaEnsayoConsultada + "</p>";

			Serial.print("-----------------------> Fecha consultada = ");
			Serial.print(fechaEnsayoConsultada);
			Serial.println(" <----------------------");

		} 
  	}

	webpage += F("<a href='/'>[Back]</a><br><br>");
	//muestra listado de archivos (pero solo los que coincidan con la fecha consultada)
	webpage += F("<form action='/dir'><input type='submit' value='Mostrar tabla filtrada'></form><br>");
	append_page_footer();
	SendHTML_Content();
	SendHTML_Stop();
*/
}


// //******************************************NESTOR****************************

//******* Calibración ***********************************************************************
void calibracionSensoresPresion(){
      int numeroSensor = 1;
      int puntoCalibracion = 0;
      int valorAcumulado = 0;
      int promedio;
      int valorDigitalCalibrado[10];
      const float valorCalibracion[10] = {0.25, 0.50, 0.75, 1.00, 1.25, 1.50, 1.75, 2.00, 2.25, 2.50};
      int m = 0;
      int b = 0;
      int muestraPorPunto = 0;
      int addressEEPROM = 0;
      int cont = 0;
      int valorPresionFuelle;
      boolean inicio = HIGH;
      boolean calibracion;
      boolean cambioSensor = LOW; 
     
      mensajeInicialLCDcalibracion(numeroSensor);
      Serial.println("Con pulsador CALIBRACION seleccione sensor: ");
      Serial.print("Sensor seleccionado: ");
      Serial.println(numeroSensor);
      Serial.println("Pulse INICIO para comenzar calibración"); 
      delay(600); 
      while(inicio == HIGH){
      calibracion = digitalRead(pulsadorCalibracion);
        if(calibracion == LOW){
          if(numeroSensor == 1){
          numeroSensor = 2;
          }else{
          numeroSensor = 1;         
          }
          delay(600);  
          cambioSensor = HIGH;      
        }
      if(cambioSensor == HIGH){
        Serial.print("Sensor seleccionado: ");
        Serial.println(numeroSensor);
        imprimirLCDfijo(String(numeroSensor),5, 1);    
        Serial.println("Pulse INICIO para comenzar calibración");    
        cambioSensor = LOW;       
      }
      inicio = digitalRead(pulsadorInicio);
     }
     delay(1000);
     if(numeroSensor == 1){
       while(puntoCalibracion < 10){
        while(muestraPorPunto < 3){
          Serial.print(muestraPorPunto + 1);
          Serial.print("º. Desde Cero suba la presión hasta ");
          Serial.print(valorCalibracion[puntoCalibracion]);
          Serial.println("kPa  y presione INICIO");
          mensajeLCDcalibracion((muestraPorPunto + 1), valorCalibracion[puntoCalibracion]);
          inicio = digitalRead(pulsadorInicio);
          while(inicio == HIGH){
            inicio = digitalRead(pulsadorInicio);
            }
          valorAcumulado = analogRead(sensorPresion1) + valorAcumulado;
          promedio = valorAcumulado / 3;
          muestraPorPunto ++;
          delay(600);
          }
        muestraPorPunto = 0;
        valorDigitalCalibrado[puntoCalibracion] = promedio;
        valorAcumulado = 0;
        puntoCalibracion ++;
       }
       imprimirLCDfijo(" Sensor 1          ",0, 2); 
       
        m = int((valorDigitalCalibrado[1] - valorDigitalCalibrado[0])/0.25);
  //      m = int((valorDigitalCalibrado[1] - valorDigitalCalibrado[0])/(valorCalibracion[1] - valorCalibracion[0]));
        b = int(valorDigitalCalibrado[0] - m*valorCalibracion[0]);
  
        //Se guadan las constantes de calibración como enteros (4By c/u)
        EEPROM.writeInt(addressEEPROM, m);       //Escribir en EEPROM m en posición 0
        EEPROM.commit();
        addressEEPROM += sizeof(m); //update address value
        EEPROM.writeInt(addressEEPROM, b);       //Escribir en EEPROM b en posición 4
        EEPROM.commit();
        addressEEPROM += sizeof(b); //update address value
  
       while(cont<9){
  //      m = int((valorDigitalCalibrado[cont+1] - valorDigitalCalibrado[cont])/(valorCalibracion[cont+1] - valorCalibracion[cont]));
        m = int((valorDigitalCalibrado[cont+1] - valorDigitalCalibrado[cont])/0.25);
        b = int(valorDigitalCalibrado[cont] - m*valorCalibracion[cont]);
  
        EEPROM.writeInt(addressEEPROM, m);       //Escribir en EEPROM m y b en posicion addressEEPROM
        EEPROM.commit();
        addressEEPROM += sizeof(m); //update address value
        EEPROM.writeInt(addressEEPROM, b);       //Escribir en EEPROM b en posicion addressEEPROM
        EEPROM.commit();
        addressEEPROM += sizeof(b); //update address value
        cont ++;
       }       
     }
     if(numeroSensor == 2){
        Serial.println("Suba la presión a 1kPa  y presione INICIO");
        mensajeLCDcalibracion(1, 1);

        inicio = HIGH;          
        while(inicio == HIGH){
          inicio = digitalRead(pulsadorInicio); 
          }
        valorPresionFuelle = analogRead(sensorPresion2);
        EEPROM.writeInt(addressEEPROM_1kPa, valorPresionFuelle);       //Escribir en EEPROM b en posicion addressEEPROM
        EEPROM.commit();
        Serial.print("El valor para 1kPa es: ");         
        Serial.println(valorPresionFuelle);
        delay(800);
        Serial.println("Suba la presión a 2kPa  y presione INICIO");
        mensajeLCDcalibracion(1, 2);
        inicio = HIGH;          
        while(inicio == HIGH){
          inicio = digitalRead(pulsadorInicio);          
          }
        valorPresionFuelle = analogRead(sensorPresion2);
        EEPROM.writeInt(addressEEPROM_2kPa, valorPresionFuelle);       //Escribir en EEPROM b en posicion addressEEPROM
        EEPROM.commit();
        Serial.print("El valor para 2kPa es: ");         
        Serial.println(valorPresionFuelle);
        delay(800);                   
       imprimirLCDfijo(" Sensor 2          ",0, 2);
     }
     imprimirLCDfijo("                    ",0, 1);
     imprimirLCDfijo(" Fin de Calibracion",0, 0);
     imprimirLCDfijo("Reinicie el equipo  ",0, 3);

     //leerEEPROM();  
     leerEEPROM1.obtenerValores();
}
//******************** Fin calibración ************************************************************
void imprimirLCD(String lineaMedicionLCD, int fila){    //Para facilitar la lectura durante el ensayo se actualiza la última medición en la última fila y la  
  static String lineaMedicionLCDanterior = "";          //medición anterior se corre hacia arriba
//    lcd.clear();
    lcd.setCursor(0, fila);
    lcd.print("                   ");
    lcd.setCursor(0, fila);
    lcd.print(lineaMedicionLCDanterior);
    lcd.setCursor(0, (fila + 1));
    lcd.print("                   ");
    lcd.setCursor(0, (fila + 1));
    lcd.print(lineaMedicionLCD);    
    lineaMedicionLCDanterior = lineaMedicionLCD;
  
