martuan/ESP32-INTI-Electronica/firmware/src/main.cpp
//******************************************************************************************
void leerSerie(){
  String comando = "";
  String dateTime = "";
  String nombreArchivo = "";
  String ano, mes, dia, hora, minutos, segundos;
  String directorio = "";
  int anoInt, mesInt, diaInt, horaInt, minutosInt, segundosInt;
  char dateTimeChar[22];
        
  comando = Serial.readStringUntil(':');
  if(comando == "setRTC"){              //Si recibe este String seguido por ":" por puerto serie seteará el RTC con la siguiente cadena año mes dia hora minutos segundos
    dateTime = Serial.readString();     // Ej.:Comando por puero serie: setRTC:20210213163218  -> año:2021, mes: 02, día: 13, hora: 16, minutos: 32, segundos: 18
    ano = dateTime.substring(0,4);
    mes = dateTime.substring(4,6);
    dia = dateTime.substring(6,8);
    hora = dateTime.substring(8,10);
    minutos = dateTime.substring(10,12);
    segundos = dateTime.substring(12,14);

    anoInt = ano.toInt();
    mesInt = mes.toInt();
    diaInt = dia.toInt();
    horaInt = hora.toInt();
    minutosInt = minutos.toInt();
    segundosInt = segundos.toInt();
    rtc.adjust(DateTime(anoInt, mesInt, diaInt, horaInt , minutosInt, segundosInt));
    DateTime now = rtc.now();
    sprintf(dateTimeChar, "%02d/%02d/%02d %02d:%02d:%02d", now.year(), now.month(),now.day(),  now.hour(), now.minute(), now.second()); 
    Serial.println("Fecha y hora modificadas: ");
    Serial.print(dateTimeChar);

  }
  if(comando == "leerDir"){
      tarjetaSD1.listDir(SD, "/", 0);
  }  
 if(comando == "leerSubDir"){
      directorio += "/";
      directorio += Serial.readString(); 
      tarjetaSD1.listSubDir(SD, directorio.c_str(), 0);
  }  
    if(comando == "leerArchivo"){
      nombreArchivo = "/";
      nombreArchivo += Serial.readString();
      tarjetaSD1.leerFile(SD, nombreArchivo.c_str());
  }  
}

void agregaFilaEnTabla(String nombreDeArchivo, String fechaNormalizada, String rutaDeArchivo){

	webpage += "<tr><td>"+ String(nombreDeArchivo) +"</td><td>"+fechaNormalizada+"</td>";
	webpage += "<td>"+String(entry.isDirectory()?"Dir":"File")+"</td>";
	int bytes = entry.size();
	String fsize = "";
	
	if (bytes < 1024)                     fsize = String(bytes)+" B";
	else if(bytes < (1024 * 1024))        fsize = String(bytes/1024.0,3)+" KB";
	else if(bytes < (1024 * 1024 * 1024)) fsize = String(bytes/1024.0/1024.0,3)+" MB";
	else                                  fsize = String(bytes/1024.0/1024.0/1024.0,3)+" GB";

	webpage += "<td>"+fsize+"</td><td><form action='/delete' method='post'><input type='text' hidden name='lname' value='"+String(rutaDeArchivo)+"'><input type='submit' name='delete' value='Borrar'></form></td>";
	Serial.print("		Archivo a descargar = ");
	Serial.print(rutaDeArchivo);
	webpage += "<td><form action='/download' method='post'><input type='text' hidden name='lname' value='"+String(rutaDeArchivo)+"'><input type='submit' name='download' value='Descargar'></form></td>";
	Serial.print("\t");
	Serial.println(String(fsize));

}



String obtenerFechaDeArchivo(void){


	int indexBeginDate = 0;
	int indexEndDate = 0;

	int indexBeginYear = 0;
	int indexEndYear = 0;

	int indexBeginMonth = 0;
	int indexEndMonth = 0;

	int indexBeginDay = 0;
	int indexEndDay = 0;

	String date = {};
	String year = {};
	String month = {};
	String day = {};
	String fecha = {};


	//********FECHA******
	indexBeginDate = 0;
	indexEndDate =	filename.indexOf('T');

	date = filename.substring(indexBeginDate,indexEndDate);//obtiene la fecha del ensayo
	//Serial.println("Fecha: ");
	//Serial.println(date);

	//********AÑO******
	indexBeginYear = 0;
	indexEndYear =	3;

	year = filename.substring(indexBeginYear,indexEndYear + 1);//obtiene el año del ensayo
	//Serial.println("Año: ");
	//Serial.println(year);

	//********MES******
	indexBeginMonth = 4;
	indexEndMonth =	5;

	month = filename.substring(indexBeginMonth,indexEndMonth + 1);//obtiene el mes del ensayo
	//Serial.println("Mes: ");
	//Serial.println(month);

	//********DIA******
	indexBeginDay = 6;
	indexEndDay =	7;

	day = filename.substring(indexBeginDay,indexEndDay + 1);//obtiene el día del ensayo
	//Serial.println("Día: ");
	//Serial.println(day);

	fecha = year + "-" + month + "-" + day;
	
	return fecha;

}

void toggleLED10veces(void){

	

	for(int i = 0; i < 10; i++){
	
		Serial.println("pin Alto");
		digitalWrite(pinLED, HIGH);
		delay(1000);
		Serial.println("pin Bajo");
		digitalWrite(pinLED, LOW);
		delay(1000);
	
	}
	

}

void armarPaqueteHtml(String strRecibido){


	//paquete_html = "<html><body>hola "
	//paquete_html = "hola" +  strRecibido + "</body>\
	//</html>";
	//paquete_html = "ass\
	//<!DOCTYPE html><html><body>\
	//pepe" + strRecibido + "</body></html>";

/*
	paquete_html = header_html + 
	"<table><tr><td><h1>ESP32 Datalogger Webserver - INTI</h1></td><td>" + strRecibido + "</td></tr></table>" + 
	


	"<h3 class='rcorners_m'>Contenido de la memoria SD</h3><br>"
	"<form action='/consultarPorFecha'><label for='Fecha'>Fecha: </label><input type='date' id='fechaEnsayo' name='fechaEnsayo'><input type='submit'></form><br>"
	"<h3 align = 'left'>Directorio actual = "+ pathDirectory + "</h3>"
	"<table class='table table-striped'>"
	"<tr><th scope='col'>Nombre</th><th scope='col'>Fecha</th><th scope='col'>Archivo/Directorio</th><th scope='col'>Tama&ntildeo</th><th scope='col'>Eliminar</th><th scope='col'>Descargar</th></tr>"
	"<tr><td><form action='/dir' method='post'><input type='hidden' name='directorioAtras' id='directorioAtras' value='../'><input type='Submit' value='../'></form></td><td></td><td></td><td></td><td align='center'></td><td></td></tr></table>" +
	ending_html;
*/

	paquete_html = header_html + 

	strRecibido +
	
	ending_html;

	webpage = "";//limpia el string


}

void reconnectWifi(void){
	cuenta = 0;

	Serial.println("Intentando reconectar");

	WiFi.begin(ssid_1, password_1);

	while ((WiFi.status() != WL_CONNECTED) && cuenta < 20) {//límite de 20 intentos de 500 ms
		delay(500);
		Serial.print(".");
		cuenta++;
	
	}
	if(WiFi.status() != WL_CONNECTED){//si no logró conectarse
	
		Serial.println("No es posible conectar a WiFi");
		//Serial.println("Se cambia a MODO LOCAL");


	}else{//si logró conectarse


		Serial.println("");
		Serial.println("Reconexion exitosa Nº ");
		cuentaReconexion++;
		Serial.println(cuentaReconexion);
		Serial.println("Conectado a red WiFi!");
		Serial.println("Dirección IP: ");
		Serial.println(WiFi.localIP());
	
	}
}